zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F84xxx/periph/PERI_SIM.h
/*
** ###################################################################
**     Processors:          MC56F84441VLF
**                          MC56F84442VLH
**                          MC56F84451VLF
**                          MC56F84452VLH
**                          MC56F84462VLH
**                          MC56F84540VLF
**                          MC56F84543VLH
**                          MC56F84550VLF
**                          MC56F84553VLH
**                          MC56F84565VLK
**                          MC56F84567VLL
**                          MC56F84587VLL
**                          MC56F84763VLH
**                          MC56F84766VLK
**                          MC56F84769VLL
**                          MC56F84786VLK
**                          MC56F84789VLL
**
**     Version:             rev. 3.0, 2024-10-29
**     Build:               b250520
**
**     Abstract:
**         CMSIS Peripheral Access Layer for SIM
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 2.0 (2021-02-06)
**         Initial version.
**     - rev. 3.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_SIM.h
 * @version 3.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for SIM
 *
 * CMSIS Peripheral Access Layer for SIM
 */

#if !defined(PERI_SIM_H_)
#define PERI_SIM_H_                              /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MC56F84441VLF))
#include "MC56F84441_COMMON.h"
#elif (defined(CPU_MC56F84442VLH))
#include "MC56F84442_COMMON.h"
#elif (defined(CPU_MC56F84451VLF))
#include "MC56F84451_COMMON.h"
#elif (defined(CPU_MC56F84452VLH))
#include "MC56F84452_COMMON.h"
#elif (defined(CPU_MC56F84462VLH))
#include "MC56F84462_COMMON.h"
#elif (defined(CPU_MC56F84540VLF))
#include "MC56F84540_COMMON.h"
#elif (defined(CPU_MC56F84543VLH))
#include "MC56F84543_COMMON.h"
#elif (defined(CPU_MC56F84550VLF))
#include "MC56F84550_COMMON.h"
#elif (defined(CPU_MC56F84553VLH))
#include "MC56F84553_COMMON.h"
#elif (defined(CPU_MC56F84565VLK))
#include "MC56F84565_COMMON.h"
#elif (defined(CPU_MC56F84567VLL))
#include "MC56F84567_COMMON.h"
#elif (defined(CPU_MC56F84587VLL))
#include "MC56F84587_COMMON.h"
#elif (defined(CPU_MC56F84763VLH))
#include "MC56F84763_COMMON.h"
#elif (defined(CPU_MC56F84766VLK))
#include "MC56F84766_COMMON.h"
#elif (defined(CPU_MC56F84769VLL))
#include "MC56F84769_COMMON.h"
#elif (defined(CPU_MC56F84786VLK))
#include "MC56F84786_COMMON.h"
#elif (defined(CPU_MC56F84789VLL))
#include "MC56F84789_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Mapping Information
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Mapping_Information Mapping Information
 * @{
 */

/** Mapping Information */
#if !defined(GPIO_PERIPHERAL_MUX_T_)
#define GPIO_PERIPHERAL_MUX_T_
/*!
 * @addtogroup Pin_Mux
 * @{
 */

/*!
 * @brief Structure for the pin mux table
 *
 * The pin mux table is soc specificed.
 * Enumeration member bitfield:
 *   BIT0~BIT1: peripheral function selector.
 *   BIT4~BIT7: pin index.
 *   BIT8~BIT11: port index.
 *   Other BITs: 0, reserved.
 */
typedef enum _gpio_peripheral_mux
{
    kGPIO_Peri_A0_ANA0_and_CMPA_IN3 = 0x0000,      /**< GPIO_A0, Pin */
    kGPIO_Peri_A0_CMPC_O            = 0x0001,      /**< GPIO_A0, Pin */
    kGPIO_Peri_C0_EXTAL             = 0x0200,      /**< GPIO_C0, Pin */
    kGPIO_Peri_C0_CLKIN0            = 0x0201,      /**< GPIO_C0, Pin */
    kGPIO_Peri_C2_TXD0              = 0x0220,      /**< GPIO_C2, Pin */
    kGPIO_Peri_C2_TB0               = 0x0221,      /**< GPIO_C2, Pin */
    kGPIO_Peri_C2_XB_IN2            = 0x0222,      /**< GPIO_C2, Pin */
    kGPIO_Peri_C2_CLKO0             = 0x0223,      /**< GPIO_C2, Pin */
    kGPIO_Peri_C3_TA0               = 0x0230,      /**< GPIO_C3, Pin */
    kGPIO_Peri_C3_CMPA_O            = 0x0231,      /**< GPIO_C3, Pin */
    kGPIO_Peri_C3_RXD0              = 0x0232,      /**< GPIO_C3, Pin */
    kGPIO_Peri_C3_CLKIN1            = 0x0233,      /**< GPIO_C3, Pin */
    kGPIO_Peri_C4_TA1               = 0x0240,      /**< GPIO_C4, Pin */
    kGPIO_Peri_C4_CMPB_O            = 0x0241,      /**< GPIO_C4, Pin */
    kGPIO_Peri_C4_XB_IN8            = 0x0242,      /**< GPIO_C4, Pin */
    kGPIO_Peri_C4_EWM_OUT_B         = 0x0243,      /**< GPIO_C4, Pin */
    kGPIO_Peri_C5_XB_IN7            = 0x0251,      /**< GPIO_C5, Pin */
    kGPIO_Peri_C6_TA2               = 0x0260,      /**< GPIO_C6, Pin */
    kGPIO_Peri_C6_XB_IN3            = 0x0261,      /**< GPIO_C6, Pin */
    kGPIO_Peri_C6_CMP_REF           = 0x0262,      /**< GPIO_C6, Pin */
    kGPIO_Peri_C7_SS0_B             = 0x0270,      /**< GPIO_C7, Pin */
    kGPIO_Peri_C7_TXD0              = 0x0271,      /**< GPIO_C7, Pin */
    kGPIO_Peri_C8_MISO0             = 0x0280,      /**< GPIO_C8, Pin */
    kGPIO_Peri_C8_RXD0              = 0x0281,      /**< GPIO_C8, Pin */
    kGPIO_Peri_C8_XB_IN9            = 0x0282,      /**< GPIO_C8, Pin */
    kGPIO_Peri_C9_SCLK0             = 0x0290,      /**< GPIO_C9, Pin */
    kGPIO_Peri_C9_XB_IN4            = 0x0291,      /**< GPIO_C9, Pin */
    kGPIO_Peri_C10_MOSI0            = 0x02A0,      /**< GPIO_C10, Pin */
    kGPIO_Peri_C10_XB_IN5           = 0x02A1,      /**< GPIO_C10, Pin */
    kGPIO_Peri_C10_MISO0            = 0x02A2,      /**< GPIO_C10, Pin */
    kGPIO_Peri_C11_SCL1             = 0x02B1,      /**< GPIO_C11, Pin */
    kGPIO_Peri_C11_TXD1             = 0x02B2,      /**< GPIO_C11, Pin */
    kGPIO_Peri_C12_SDA1             = 0x02C1,      /**< GPIO_C12, Pin */
    kGPIO_Peri_C12_RXD1             = 0x02C2,      /**< GPIO_C12, Pin */
    kGPIO_Peri_C13_TA3              = 0x02D0,      /**< GPIO_C13, Pin */
    kGPIO_Peri_C13_XB_IN6           = 0x02D1,      /**< GPIO_C13, Pin */
    kGPIO_Peri_C13_EWM_OUT_B        = 0x02D2,      /**< GPIO_C13, Pin */
    kGPIO_Peri_C14_SDA0             = 0x02E0,      /**< GPIO_C14, Pin */
    kGPIO_Peri_C14_XB_OUT4          = 0x02E1,      /**< GPIO_C14, Pin */
    kGPIO_Peri_C15_SCL0             = 0x02F0,      /**< GPIO_C15, Pin */
    kGPIO_Peri_C15_XB_OUT5          = 0x02F1,      /**< GPIO_C15, Pin */
    kGPIO_Peri_E4_PWMA_2B           = 0x0440,      /**< GPIO_E4, Pin */
    kGPIO_Peri_E4_XB_IN2            = 0x0441,      /**< GPIO_E4, Pin */
    kGPIO_Peri_E5_PWMA_2A           = 0x0450,      /**< GPIO_E5, Pin */
    kGPIO_Peri_E5_XB_IN3            = 0x0451,      /**< GPIO_E5, Pin */
    kGPIO_Peri_F0_XB_IN6            = 0x0500,      /**< GPIO_F0, Pin */
    kGPIO_Peri_F0_TB2               = 0x0501,      /**< GPIO_F0, Pin */
    kGPIO_Peri_F1_CLKO1             = 0x0510,      /**< GPIO_F1, Pin */
    kGPIO_Peri_F1_XB_IN7            = 0x0511,      /**< GPIO_F1, Pin */
    kGPIO_Peri_E6_PWMA_3B           = 0x0460,      /**< GPIO_E6, Pin */
    kGPIO_Peri_E6_XB_IN4            = 0x0461,      /**< GPIO_E6, Pin */
    kGPIO_Peri_E7_PWMA_3A           = 0x0470,      /**< GPIO_E7, Pin */
    kGPIO_Peri_E7_XB_IN5            = 0x0471,      /**< GPIO_E7, Pin */
    kGPIO_Peri_F1_CMPD_O            = 0x0512,      /**< GPIO_F1, Pin */
    kGPIO_Peri_F2_SCL1              = 0x0520,      /**< GPIO_F2, Pin */
    kGPIO_Peri_F2_XB_OUT6           = 0x0521,      /**< GPIO_F2, Pin */
    kGPIO_Peri_F3_SDA1              = 0x0530,      /**< GPIO_F3, Pin */
    kGPIO_Peri_F3_XB_OUT7           = 0x0531,      /**< GPIO_F3, Pin */
    kGPIO_Peri_F4_TXD1              = 0x0540,      /**< GPIO_F4, Pin */
    kGPIO_Peri_F4_XB_OUT8           = 0x0541,      /**< GPIO_F4, Pin */
    kGPIO_Peri_F5_RXD1              = 0x0550,      /**< GPIO_F5, Pin */
    kGPIO_Peri_F5_XB_OUT9           = 0x0551,      /**< GPIO_F5, Pin */
    kGPIO_Peri_F6_TB2               = 0x0560,      /**< GPIO_F6, Pin */
    kGPIO_Peri_F6_PWMA_3X           = 0x0561,      /**< GPIO_F6, Pin */
    kGPIO_Peri_F6_XB_IN2            = 0x0563,      /**< GPIO_F6, Pin */
    kGPIO_Peri_F7_TB3               = 0x0570,      /**< GPIO_F7, Pin */
    kGPIO_Peri_F7_CMPC_O            = 0x0571,      /**< GPIO_F7, Pin */
    kGPIO_Peri_F7_XB_IN3            = 0x0573,      /**< GPIO_F7, Pin */
    kGPIO_Peri_F8_RXD0              = 0x0580,      /**< GPIO_F8, Pin */
    kGPIO_Peri_F8_TB1               = 0x0581,      /**< GPIO_F8, Pin */
    kGPIO_Peri_F8_CMPD_O            = 0x0582,      /**< GPIO_F8, Pin */
    kGPIO_Peri_C11_CANTX            = 0x02B0,      /**< GPIO_C11, Pin */
    kGPIO_Peri_C12_CANRX            = 0x02C0,      /**< GPIO_C12, Pin */
    kGPIO_Peri_C5_DACO              = 0x0250,      /**< GPIO_C5, Pin */
    kGPIO_Peri_D5_RXD2              = 0x0350,      /**< GPIO_D5, Pin */
    kGPIO_Peri_D5_XB_IN5            = 0x0351,      /**< GPIO_D5, Pin */
    kGPIO_Peri_D5_XB_OUT9           = 0x0352,      /**< GPIO_D5, Pin */
    kGPIO_Peri_D6_TXD2              = 0x0360,      /**< GPIO_D6, Pin */
    kGPIO_Peri_D6_XB_IN4            = 0x0361,      /**< GPIO_D6, Pin */
    kGPIO_Peri_D6_XB_OUT8           = 0x0362,      /**< GPIO_D6, Pin */
    kGPIO_Peri_D7_XB_OUT11          = 0x0370,      /**< GPIO_D7, Pin */
    kGPIO_Peri_D7_XB_IN7            = 0x0371,      /**< GPIO_D7, Pin */
    kGPIO_Peri_D7_MISO1             = 0x0372,      /**< GPIO_D7, Pin */
    kGPIO_Peri_E6_PWMB_2B           = 0x0462,      /**< GPIO_E6, Pin */
    kGPIO_Peri_E7_PWMB_2A           = 0x0472,      /**< GPIO_E7, Pin */
    kGPIO_Peri_F0_SCLK1             = 0x0502,      /**< GPIO_F0, Pin */
    kGPIO_Peri_F6_PWMB_3X           = 0x0562,      /**< GPIO_F6, Pin */
    kGPIO_Peri_F7_SS1_B             = 0x0572,      /**< GPIO_F7, Pin */
    kGPIO_Peri_F9_RXD2              = 0x0590,      /**< GPIO_F9, Pin */
    kGPIO_Peri_F9_PWMA_FAULT7       = 0x0591,      /**< GPIO_F9, Pin */
    kGPIO_Peri_F9_PWMB_FAULT7       = 0x0592,      /**< GPIO_F9, Pin */
    kGPIO_Peri_F9_XB_OUT11          = 0x0593,      /**< GPIO_F9, Pin */
    kGPIO_Peri_F10_TXD2             = 0x05A0,      /**< GPIO_F10, Pin */
    kGPIO_Peri_F10_PWMA_FAULT6      = 0x05A1,      /**< GPIO_F10, Pin */
    kGPIO_Peri_F10_PWMB_FAULT6      = 0x05A2,      /**< GPIO_F10, Pin */
    kGPIO_Peri_F10_XB_OUT10         = 0x05A3,      /**< GPIO_F10, Pin */
    kGPIO_Peri_G0_PWMB_1B           = 0x0600,      /**< GPIO_G0, Pin */
    kGPIO_Peri_G0_XB_OUT6           = 0x0601,      /**< GPIO_G0, Pin */
    kGPIO_Peri_G1_PWMB_1A           = 0x0610,      /**< GPIO_G1, Pin */
    kGPIO_Peri_G1_XB_OUT7           = 0x0611,      /**< GPIO_G1, Pin */
    kGPIO_Peri_G2_PWMB_0B           = 0x0620,      /**< GPIO_G2, Pin */
    kGPIO_Peri_G2_XB_OUT4           = 0x0621,      /**< GPIO_G2, Pin */
    kGPIO_Peri_G3_PWMB_0A           = 0x0630,      /**< GPIO_G3, Pin */
    kGPIO_Peri_G3_XB_OUT5           = 0x0631,      /**< GPIO_G3, Pin */
    kGPIO_Peri_G6_PWMA_FAULT4       = 0x0660,      /**< GPIO_G6, Pin */
    kGPIO_Peri_G6_PWMB_FAULT4       = 0x0661,      /**< GPIO_G6, Pin */
    kGPIO_Peri_G6_TB2               = 0x0662,      /**< GPIO_G6, Pin */
    kGPIO_Peri_G6_XB_OUT8           = 0x0663,      /**< GPIO_G6, Pin */
    kGPIO_Peri_G7_PWMA_FAULT5       = 0x0670,      /**< GPIO_G7, Pin */
    kGPIO_Peri_G7_PWMB_FAULT5       = 0x0671,      /**< GPIO_G7, Pin */
    kGPIO_Peri_G7_XB_OUT9           = 0x0672,      /**< GPIO_G7, Pin */
    kGPIO_Peri_G11_TB3              = 0x06B0,      /**< GPIO_G11, Pin */
    kGPIO_Peri_G11_CLKO0            = 0x06B1,      /**< GPIO_G11, Pin */
    kGPIO_Peri_G11_MOSI1            = 0x06B2,      /**< GPIO_G11, Pin */
    kGPIO_Peri_B9_ANC21             = 0x0190,      /**< GPIO_B9, Pin */
    kGPIO_Peri_B9_XB_IN9            = 0x0191,      /**< GPIO_B9, Pin */
    kGPIO_Peri_B9_MISO2             = 0x0192,      /**< GPIO_B9, Pin */
    kGPIO_Peri_B10_ANC22            = 0x01A0,      /**< GPIO_B10, Pin */
    kGPIO_Peri_B10_XB_IN8           = 0x01A1,      /**< GPIO_B10, Pin */
    kGPIO_Peri_B10_MOSI2            = 0x01A2,      /**< GPIO_B10, Pin */
    kGPIO_Peri_B11_ANC23            = 0x01B0,      /**< GPIO_B11, Pin */
    kGPIO_Peri_B11_XB_IN7           = 0x01B1,      /**< GPIO_B11, Pin */
    kGPIO_Peri_B11_SCLK2            = 0x01B2,      /**< GPIO_B11, Pin */
    kGPIO_Peri_E8_PWMB_2B           = 0x0480,      /**< GPIO_E8, Pin */
    kGPIO_Peri_E8_PWMA_FAULT0       = 0x0481,      /**< GPIO_E8, Pin */
    kGPIO_Peri_E9_PWMB_2A           = 0x0490,      /**< GPIO_E9, Pin */
    kGPIO_Peri_E9_PWMA_FAULT1       = 0x0491,      /**< GPIO_E9, Pin */
    kGPIO_Peri_F11_TXD0             = 0x05B0,      /**< GPIO_F11, Pin */
    kGPIO_Peri_F11_XB_IN11          = 0x05B1,      /**< GPIO_F11, Pin */
    kGPIO_Peri_F12_MISO1            = 0x05C0,      /**< GPIO_F12, Pin */
    kGPIO_Peri_F12_PWMB_FAULT2      = 0x05C1,      /**< GPIO_F12, Pin */
    kGPIO_Peri_F13_MOSI1            = 0x05D0,      /**< GPIO_F13, Pin */
    kGPIO_Peri_F13_PWMB_FAULT1      = 0x05D1,      /**< GPIO_F13, Pin */
    kGPIO_Peri_F14_SCLK1            = 0x05E0,      /**< GPIO_F14, Pin */
    kGPIO_Peri_F14_PWMB_FAULT0      = 0x05E1,      /**< GPIO_F14, Pin */
    kGPIO_Peri_F15_RXD0             = 0x05F0,      /**< GPIO_F15, Pin */
    kGPIO_Peri_F15_XB_IN10          = 0x05F1,      /**< GPIO_F15, Pin */
    kGPIO_Peri_G4_PWMB_3B           = 0x0640,      /**< GPIO_G4, Pin */
    kGPIO_Peri_G4_PWMA_FAULT2       = 0x0641,      /**< GPIO_G4, Pin */
    kGPIO_Peri_G5_PWMB_3A           = 0x0650,      /**< GPIO_G5, Pin */
    kGPIO_Peri_G5_PWMA_FAULT3       = 0x0651,      /**< GPIO_G5, Pin */
    kGPIO_Peri_G8_PWMB_0X           = 0x0680,      /**< GPIO_G8, Pin */
    kGPIO_Peri_G8_PWMA_0X           = 0x0681,      /**< GPIO_G8, Pin */
    kGPIO_Peri_G8_TA2               = 0x0682,      /**< GPIO_G8, Pin */
    kGPIO_Peri_G8_XB_OUT10          = 0x0683,      /**< GPIO_G8, Pin */
    kGPIO_Peri_G9_PWMB_1X           = 0x0690,      /**< GPIO_G9, Pin */
    kGPIO_Peri_G9_PWMA_1X           = 0x0691,      /**< GPIO_G9, Pin */
    kGPIO_Peri_G9_TA3               = 0x0692,      /**< GPIO_G9, Pin */
    kGPIO_Peri_G9_XB_OUT11          = 0x0693,      /**< GPIO_G9, Pin */
    kGPIO_Peri_G10_PWMB_2X          = 0x06A0,      /**< GPIO_G10, Pin */
    kGPIO_Peri_G10_PWMA_2X          = 0x06A1,      /**< GPIO_G10, Pin */
    kGPIO_Peri_G10_XB_IN8           = 0x06A2,      /**< GPIO_G10, Pin */
    kGPIO_Peri_G10_SS2_B            = 0x06A3,      /**< GPIO_G10, Pin */
} gpio_peripheral_mux_t;

/* @} */
#endif /* GPIO_PERIPHERAL_MUX_T_ */

#if !defined(SIM_SWRESET_PERI_INDEX_T_)
#define SIM_SWRESET_PERI_INDEX_T_
typedef enum _sim_swReset_peri_index
{
    kSIM_SWResetGPIO                = 6U,          /**< GPIO Software Reset. */
    kSIM_SWResetTMRB                = 11U,         /**< TMRB Software Reset. */
    kSIM_SWResetTMRA                = 15U,         /**< TMRA Software Reset. */
    kSIM_SWResetFLEXCAN             = 16U,         /**< FlexCAN Software Reset. */
    kSIM_SWResetIIC1                = 21U,         /**< IIC1 Software Reset. */
    kSIM_SWResetIIC0                = 22U,         /**< IIC0 Software Reset. */
    kSIM_SWResetQSPI1               = 24U,         /**< QSPI1 Software Reset. */
    kSIM_SWResetQSPI0               = 25U,         /**< QSPI0 Software Reset. */
    kSIM_SWResetSCI1                = 27U,         /**< SCI1 Software Reset. */
    kSIM_SWResetSCI0                = 28U,         /**< SCI0 Software Reset. */
    kSIM_SWResetDAC                 = 29U,         /**< DAC Software Reset. */
    kSIM_SWResetPDB1                = 32U,         /**< Programmable Delay Block Software Reset. */
    kSIM_SWResetPDB0                = 33U,         /**< Programmable Delay Block Software Reset. */
    kSIM_SWResetPIT1                = 34U,         /**< PIT1 Software Reset. */
    kSIM_SWResetPIT0                = 35U,         /**< PIT0 Software Reset. */
    kSIM_SWResetQDC                 = 36U,         /**< Quadrature Decoder Software Reset. */
    kSIM_SWResetCRC                 = 37U,         /**< CRC Software Reset. */
    kSIM_SWResetCADC                = 39U,         /**< Cyclic ADC Software Reset. */
    kSIM_SWResetSARADC              = 40U,         /**< SAR ADC Software Reset. */
    kSIM_SWResetCMP                 = 44U,         /**< CMP Software Reset. */
    kSIM_SWResetEWM                 = 47U,         /**< EWM Software Reset. */
    kSIM_SWResetPWMA                = 55U,         /**< PWMA Software Reset. */
    kSIM_SWResetQSPI2               = 23U,         /**< QSPI2 Software Reset. */
    kSIM_SWResetSCI2                = 26U,         /**< SCI2 Software Reset. */
    kSIM_SWResetPWMB                = 51U,         /**< PWMB Software Reset. */
} sim_swReset_peri_index_t;
#endif /* SIM_SWRESET_PERI_INDEX_T_ */

#if !defined(SIM_INTERNAL_PERI_INDEX_T_)
#define SIM_INTERNAL_PERI_INDEX_T_
typedef enum _sim_internal_peri_index
{
    kSIM_PWMAFault0InputIndex       = 0U,          /**< Select PWMA Fault 0 Input. */
    kSIM_PWMAFault1InputIndex       = 1U,          /**< Select PWMA Fault 1 Input. */
    kSIM_PWMAFault2InputIndex       = 2U,          /**< Select PWMA Fault 2 Input. */
    kSIM_PWMAFault3InputIndex       = 3U,          /**< Select PWMA Fault 3 Input. */
    kSIM_TMRA0InputIndex            = 8U,          /**< Select TMRA0 Input. */
    kSIM_TMRA1InputIndex            = 9U,          /**< Select TMRA1 Input. */
    kSIM_TMRA2InputIndex            = 10U,         /**< Select TMRA2 Input. */
    kSIM_TMRA3InputIndex            = 11U,         /**< Select TMRA3 Input. */
    kSIM_TMRB0InputIndex            = 12U,         /**< Select TMRB0 Input. */
    kSIM_TMRB1InputIndex            = 13U,         /**< Select TMRB1 Input. */
    kSIM_TMRB2InputIndex            = 14U,         /**< Select TMRB2 Input. */
    kSIM_TMRB3InputIndex            = 15U,         /**< Select TMRB3 Input. */
    kSIM_PWMBFault0InputIndex       = 4U,          /**< Select PWMB Fault 0 Input. */
    kSIM_PWMBFault1InputIndex       = 5U,          /**< Select PWMB Fault 1 Input. */
    kSIM_PWMBFault2InputIndex       = 6U,          /**< Select PWMB Fault 2 Input. */
} sim_internal_peri_index_t;
