zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F84xxx/periph/PERI_SIM.h
#define SIM_PSWR1_SCI0_MASK                      (0x1000U)
#define SIM_PSWR1_SCI0_SHIFT                     (12U)
/*! SCI0 - SCI0 Software Reset
 *  0b0..The corresponding peripheral is not reset.
 *  0b1..The corresponding peripheral is reset.
 */
#define SIM_PSWR1_SCI0(x)                        (((uint16_t)(((uint16_t)(x)) << SIM_PSWR1_SCI0_SHIFT)) & SIM_PSWR1_SCI0_MASK)

#define SIM_PSWR1_DAC_MASK                       (0x2000U)
#define SIM_PSWR1_DAC_SHIFT                      (13U)
/*! DAC - DAC Software Reset
 *  0b0..The corresponding peripheral is not reset.
 *  0b1..The corresponding peripheral is reset.
 */
#define SIM_PSWR1_DAC(x)                         (((uint16_t)(((uint16_t)(x)) << SIM_PSWR1_DAC_SHIFT)) & SIM_PSWR1_DAC_MASK)
/*! @} */

/*! @name PSWR2 - Peripheral Software Reset Register 2 */
/*! @{ */

#define SIM_PSWR2_PDB1_MASK                      (0x1U)
#define SIM_PSWR2_PDB1_SHIFT                     (0U)
/*! PDB1 - Programmable Delay Block Software Reset
 *  0b0..The corresponding peripheral is not reset.
 *  0b1..The corresponding peripheral is reset.
 */
#define SIM_PSWR2_PDB1(x)                        (((uint16_t)(((uint16_t)(x)) << SIM_PSWR2_PDB1_SHIFT)) & SIM_PSWR2_PDB1_MASK)

#define SIM_PSWR2_PDB0_MASK                      (0x2U)
#define SIM_PSWR2_PDB0_SHIFT                     (1U)
/*! PDB0 - Programmable Delay Block Software Reset
 *  0b0..The corresponding peripheral is not reset.
 *  0b1..The corresponding peripheral is reset.
 */
#define SIM_PSWR2_PDB0(x)                        (((uint16_t)(((uint16_t)(x)) << SIM_PSWR2_PDB0_SHIFT)) & SIM_PSWR2_PDB0_MASK)

#define SIM_PSWR2_PIT1_MASK                      (0x4U)
#define SIM_PSWR2_PIT1_SHIFT                     (2U)
/*! PIT1 - Programmable Interval Timer Software Reset
 *  0b0..The corresponding peripheral is not reset.
 *  0b1..The corresponding peripheral is reset.
 */
#define SIM_PSWR2_PIT1(x)                        (((uint16_t)(((uint16_t)(x)) << SIM_PSWR2_PIT1_SHIFT)) & SIM_PSWR2_PIT1_MASK)

#define SIM_PSWR2_PIT0_MASK                      (0x8U)
#define SIM_PSWR2_PIT0_SHIFT                     (3U)
/*! PIT0 - Programmable Interval Timer Software Reset
 *  0b0..The corresponding peripheral is not reset.
 *  0b1..The corresponding peripheral is reset.
 */
#define SIM_PSWR2_PIT0(x)                        (((uint16_t)(((uint16_t)(x)) << SIM_PSWR2_PIT0_SHIFT)) & SIM_PSWR2_PIT0_MASK)

#define SIM_PSWR2_QDC_MASK                       (0x10U)
#define SIM_PSWR2_QDC_SHIFT                      (4U)
/*! QDC - Quadrature Decoder Software Reset
 *  0b0..The corresponding peripheral is not reset.
 *  0b1..The corresponding peripheral is reset.
 */
#define SIM_PSWR2_QDC(x)                         (((uint16_t)(((uint16_t)(x)) << SIM_PSWR2_QDC_SHIFT)) & SIM_PSWR2_QDC_MASK)

#define SIM_PSWR2_CRC_MASK                       (0x20U)
#define SIM_PSWR2_CRC_SHIFT                      (5U)
/*! CRC - CRC Software Reset
 *  0b0..The corresponding peripheral is not reset.
 *  0b1..The corresponding peripheral is reset.
 */
#define SIM_PSWR2_CRC(x)                         (((uint16_t)(((uint16_t)(x)) << SIM_PSWR2_CRC_SHIFT)) & SIM_PSWR2_CRC_MASK)

#define SIM_PSWR2_CYCADC_MASK                    (0x80U)
#define SIM_PSWR2_CYCADC_SHIFT                   (7U)
/*! CYCADC - Cyclic ADC Software Reset
 *  0b0..The corresponding peripheral is not reset.
 *  0b1..The corresponding peripheral is reset.
 */
#define SIM_PSWR2_CYCADC(x)                      (((uint16_t)(((uint16_t)(x)) << SIM_PSWR2_CYCADC_SHIFT)) & SIM_PSWR2_CYCADC_MASK)

#define SIM_PSWR2_SARADC_MASK                    (0x100U)
#define SIM_PSWR2_SARADC_SHIFT                   (8U)
/*! SARADC - SAR ADC Software Reset
 *  0b0..The corresponding peripheral is not reset.
 *  0b1..The corresponding peripheral is reset.
 */
#define SIM_PSWR2_SARADC(x)                      (((uint16_t)(((uint16_t)(x)) << SIM_PSWR2_SARADC_SHIFT)) & SIM_PSWR2_SARADC_MASK)

#define SIM_PSWR2_CMP_MASK                       (0x1000U)
#define SIM_PSWR2_CMP_SHIFT                      (12U)
/*! CMP - CMP Software Reset
 *  0b0..The corresponding peripheral is not reset.
 *  0b1..The corresponding peripheral is reset.
 */
#define SIM_PSWR2_CMP(x)                         (((uint16_t)(((uint16_t)(x)) << SIM_PSWR2_CMP_SHIFT)) & SIM_PSWR2_CMP_MASK)

#define SIM_PSWR2_EWM_MASK                       (0x8000U)
#define SIM_PSWR2_EWM_SHIFT                      (15U)
/*! EWM - EWM Software Reset
 *  0b0..The corresponding peripheral is not reset.
 *  0b1..The corresponding peripheral is reset.
 */
#define SIM_PSWR2_EWM(x)                         (((uint16_t)(((uint16_t)(x)) << SIM_PSWR2_EWM_SHIFT)) & SIM_PSWR2_EWM_MASK)
/*! @} */

/*! @name PSWR3 - Peripheral Software Reset Register 3 */
/*! @{ */

#define SIM_PSWR3_PWMB_MASK                      (0x8U)
#define SIM_PSWR3_PWMB_SHIFT                     (3U)
/*! PWMB - PWMB Software Reset
 *  0b0..The corresponding peripheral is not reset.
 *  0b1..The corresponding peripheral is reset.
 */
#define SIM_PSWR3_PWMB(x)                        (((uint16_t)(((uint16_t)(x)) << SIM_PSWR3_PWMB_SHIFT)) & SIM_PSWR3_PWMB_MASK)

#define SIM_PSWR3_PWMA_MASK                      (0x80U)
#define SIM_PSWR3_PWMA_SHIFT                     (7U)
/*! PWMA - PWMA Software Reset
 *  0b0..The corresponding peripheral is not reset.
 *  0b1..The corresponding peripheral is reset.
 */
#define SIM_PSWR3_PWMA(x)                        (((uint16_t)(((uint16_t)(x)) << SIM_PSWR3_PWMA_SHIFT)) & SIM_PSWR3_PWMA_MASK)
/*! @} */

/*! @name PWRMODE - Power Mode Register */
/*! @{ */

#define SIM_PWRMODE_VLPMODE_MASK                 (0x1U)
#define SIM_PWRMODE_VLPMODE_SHIFT                (0U)
/*! VLPMODE - VLPMODE Entry/Exit
 *  0b0..Start exit from VLPMODE
 *  0b1..Start entry to VLPMODE
 */
#define SIM_PWRMODE_VLPMODE(x)                   (((uint16_t)(((uint16_t)(x)) << SIM_PWRMODE_VLPMODE_SHIFT)) & SIM_PWRMODE_VLPMODE_MASK)

#define SIM_PWRMODE_LPMODE_MASK                  (0x2U)
#define SIM_PWRMODE_LPMODE_SHIFT                 (1U)
/*! LPMODE - LPMODE Entry/Exit
 *  0b0..Start exit from LPMODE
 *  0b1..Start entry to LPMODE
 */
#define SIM_PWRMODE_LPMODE(x)                    (((uint16_t)(((uint16_t)(x)) << SIM_PWRMODE_LPMODE_SHIFT)) & SIM_PWRMODE_LPMODE_MASK)

#define SIM_PWRMODE_VLPMS_MASK                   (0x100U)
#define SIM_PWRMODE_VLPMS_SHIFT                  (8U)
/*! VLPMS - VLPMODE Status Indicator
 *  0b0..Not in VLPMODE
 *  0b1..In VLPMODE
 */
#define SIM_PWRMODE_VLPMS(x)                     (((uint16_t)(((uint16_t)(x)) << SIM_PWRMODE_VLPMS_SHIFT)) & SIM_PWRMODE_VLPMS_MASK)

#define SIM_PWRMODE_LPMS_MASK                    (0x200U)
#define SIM_PWRMODE_LPMS_SHIFT                   (9U)
/*! LPMS - LPMODE Status Indicator
 *  0b0..Not in LPMODE
 *  0b1..In LPMODE
 */
#define SIM_PWRMODE_LPMS(x)                      (((uint16_t)(((uint16_t)(x)) << SIM_PWRMODE_LPMS_SHIFT)) & SIM_PWRMODE_LPMS_MASK)
/*! @} */

/*! @name NVMOPT2H - Non-Volatile Memory Option Register 2 (High) */
/*! @{ */

#define SIM_NVMOPT2H_ROSC_8M_FTRIM_MASK          (0x3FFU)
#define SIM_NVMOPT2H_ROSC_8M_FTRIM_SHIFT         (0U)
/*! ROSC_8M_FTRIM - 8 MHz Relaxation Oscillator Frequency Trim */
#define SIM_NVMOPT2H_ROSC_8M_FTRIM(x)            (((uint16_t)(((uint16_t)(x)) << SIM_NVMOPT2H_ROSC_8M_FTRIM_SHIFT)) & SIM_NVMOPT2H_ROSC_8M_FTRIM_MASK)

#define SIM_NVMOPT2H_ROSC_8M_TTRIM_MASK          (0x3C00U)
#define SIM_NVMOPT2H_ROSC_8M_TTRIM_SHIFT         (10U)
/*! ROSC_8M_TTRIM - 8 MHz Relaxation Oscillator Temperature Trim */
#define SIM_NVMOPT2H_ROSC_8M_TTRIM(x)            (((uint16_t)(((uint16_t)(x)) << SIM_NVMOPT2H_ROSC_8M_TTRIM_SHIFT)) & SIM_NVMOPT2H_ROSC_8M_TTRIM_MASK)
/*! @} */

/*! @name NVMOPT2L - Non-Volatile Memory Option Register 2 (Low) */
/*! @{ */

#define SIM_NVMOPT2L_ROSC_32K_FTRIM_MASK         (0x1FFU)
#define SIM_NVMOPT2L_ROSC_32K_FTRIM_SHIFT        (0U)
/*! ROSC_32K_FTRIM - 32 kHz Relaxation Oscillator Frequency Trim */
#define SIM_NVMOPT2L_ROSC_32K_FTRIM(x)           (((uint16_t)(((uint16_t)(x)) << SIM_NVMOPT2L_ROSC_32K_FTRIM_SHIFT)) & SIM_NVMOPT2L_ROSC_32K_FTRIM_MASK)

#define SIM_NVMOPT2L_PMC_BGTRIM_MASK             (0xF000U)
#define SIM_NVMOPT2L_PMC_BGTRIM_SHIFT            (12U)
/*! PMC_BGTRIM - PMC Bandgap Trim */
#define SIM_NVMOPT2L_PMC_BGTRIM(x)               (((uint16_t)(((uint16_t)(x)) << SIM_NVMOPT2L_PMC_BGTRIM_SHIFT)) & SIM_NVMOPT2L_PMC_BGTRIM_MASK)
/*! @} */

/*! @name NVMOPT3H - Non-Volatile Memory Option Register 3 (High) */
/*! @{ */

#define SIM_NVMOPT3H_SAR_VREFBG_TRIM_MASK        (0xFFFFU)
#define SIM_NVMOPT3H_SAR_VREFBG_TRIM_SHIFT       (0U)
/*! SAR_VREFBG_TRIM - SAR ADC Bandgap Reference Capture */
#define SIM_NVMOPT3H_SAR_VREFBG_TRIM(x)          (((uint16_t)(((uint16_t)(x)) << SIM_NVMOPT3H_SAR_VREFBG_TRIM_SHIFT)) & SIM_NVMOPT3H_SAR_VREFBG_TRIM_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group SIM_Register_Masks */


/*!
 * @}
 */ /* end of group SIM_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__CWCC__)
  #pragma pop
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_SIM_H_ */

